package HomeTask03;

//3 Дано двузначное число. Выведите его первую цифру(то есть количество десятков)
public class Task3{
    public static void main(String[] args) {
      int x = 23;
      x /= 10;
        System.out.println(x);

    }
}