package HomeTask03;

//8 В следующей программе объясните, почему значение"6" печатается дважды подряд

class Task8 {
    public static void main(String[] args) {
        int i = 3;
        i++;
        System.out.println(i); // "4"
        ++i;
        System.out.println(i);    // "5"
        System.out.println(++i);  // "6" Если инкеремент стоит перед переменной - то переменная сначала инкрементируется
                                  //     а потом над ней проводится операция.
        System.out.println(i++);  // "6" А если инкремент стоит после переменноц - вначале проводится операция , а потом
                                  //     она инкрементируется (в 14 строчке переменная сперва будет выведена в консоль, а
                                  //     а затем инкрементирована
        System.out.println(i);    // "7"

    }
}
